{"category": "general", "question_en": "What are the clinic operating hours?", "question_ms": "Apakah waktu operasi klinik?", "answer_en": "Klinik Kesihatan Petaling Jaya is open Monday to Friday, 8:00 AM - 5:00 PM. Closed on weekends and public holidays. For emergencies, call 999 or visit the nearest hospital.", "answer_ms": "Klinik Kesihatan Petaling Jaya buka Isnin hingga Jumaat, 8:00 pagi - 5:00 petang. Tutup pada hujung minggu dan cuti umum. Untuk kecemasan, hubungi 999 atau lawati hospital terdekat.", "keywords": "hours, time, operating, waktu, operasi, buka"}
{"category": "services", "question_en": "What services do you provide?", "question_ms": "Apakah perkhidmatan yang disediakan?", "answer_en": "We provide: General consultation, Vaccination (COVID-19, flu, HPV), Health screening, Prescription refills, Minor wound treatment, Blood pressure/glucose monitoring, Referrals to specialists.", "answer_ms": "Kami menyediakan: Perundingan am, Vaksinasi (COVID-19, selesema, HPV), Saringan kesihatan, Pengisian semula preskripsi, Rawatan luka kecil, Pemantauan tekanan darah/glukosa, Rujukan kepada pakar.", "keywords": "services, perkhidmatan, vaccination, vaksinasi, consultation, perundingan"}
{"category": "appointment", "question_en": "How do I book an appointment?", "question_ms": "Bagaimana cara membuat temujanji?", "answer_en": "You can book an appointment through this chatbot by clicking 'Book Appointment' or call us at 03-7956 2424. Walk-ins are accepted but appointments get priority. Bring your IC and previous medical records if available.", "answer_ms": "Anda boleh membuat temujanji melalui chatbot ini dengan klik 'Tempah Temujanji' atau hubungi kami di 03-7956 2424. Walk-in diterima tetapi temujanji diberi keutamaan. Bawa IC dan rekod perubatan lama jika ada.", "keywords": "appointment, temujanji, booking, tempahan, book, tempah"}
{"category": "symptoms_fever", "question_en": "I have a fever, what should I do?", "question_ms": "Saya demam, apa yang perlu saya buat?", "answer_en": "For fever: 1. Rest and drink plenty of water. 2. Take paracetamol (follow dosage instructions). 3. Monitor temperature every 4 hours. 4. Visit the clinic if fever persists >3 days, temperature >39°C, or with severe symptoms (difficulty breathing, chest pain, confusion). For children under 2 or elderly, seek medical attention sooner.", "answer_ms": "Untuk demam: 1. Berehat dan minum air banyak. 2. Ambil paracetamol (ikut dos). 3. Pantau suhu setiap 4 jam. 4. Lawati klinik jika demam >3 hari, suhu >39°C, atau gejala teruk (sesak nafas, sakit dada, keliru). Untuk kanak-kanak bawah 2 tahun atau warga emas, dapatkan rawatan lebih awal.", "keywords": "fever, demam, temperature, suhu, paracetamol"}
{"category": "symptoms_cough", "question_en": "I have a persistent cough, should I come in?", "question_ms": "Saya batuk berterusan, perlu datang ke klinik?", "answer_en": "Come to the clinic if: Cough lasts >2 weeks, Coughing up blood or green/yellow phlegm, Shortness of breath or chest pain, High fever with cough. For mild dry cough, rest, stay hydrated, use honey/warm drinks. Wear a mask around others.", "answer_ms": "Datang ke klinik jika: Batuk >2 minggu, Batuk berdarah atau kahak hijau/kuning, Sesak nafas atau sakit dada, Demam tinggi dengan batuk. Untuk batuk kering ringan, berehat, minum air, guna madu/minuman suam. Pakai mask bila bersama orang lain.", "keywords": "cough, batuk, persistent, berterusan, phlegm, kahak"}
{"category": "symptoms_rash", "question_en": "I have a skin rash, is it serious?", "question_ms": "Saya ada ruam kulit, adakah serius?", "answer_en": "Most rashes are not serious. Visit the clinic if: Rash spreads quickly, Accompanied by fever or difficulty breathing, Very painful or blistering, Rash after new medication. For mild rash: Keep area clean and dry, Avoid scratching, Use calamine lotion. Possible causes: allergy, heat rash, eczema, infection.", "answer_ms": "Kebanyakan ruam tidak serius. Lawati klinik jika: Ruam merebak cepat, Disertai demam atau sesak nafas, Sangat sakit atau melecur, Ruam selepas ubat baru. Untuk ruam ringan: Kekalkan kawasan bersih dan kering, Jangan garu, Guna lotion calamine. Punca: alahan, ruam haba, ekzema, jangkitan.", "keywords": "rash, ruam, skin, kulit, allergy, alahan, itch, gatal"}
{"category": "emergency", "question_en": "When should I call 999?", "question_ms": "Bila perlu hubungi 999?", "answer_en": "Call 999 immediately for: Chest pain or pressure, Difficulty breathing or choking, Severe bleeding that won't stop, Loss of consciousness or fainting, Seizures, Severe burns, Poisoning or overdose, Severe allergic reaction (anaphylaxis), Stroke symptoms (face drooping, arm weakness, speech difficulty). Do not drive yourself—wait for ambulance.", "answer_ms": "Hubungi 999 segera untuk: Sakit dada atau tekanan, Sesak nafas atau tercekik, Pendarahan teruk tidak berhenti, Pengsan atau hilang kesedaran, Sawan, Melecur teruk, Keracunan atau overdos, Alahan teruk (anafilaksis), Simptom strok (muka senget, tangan lemah, sukar bercakap). Jangan pandu sendiri—tunggu ambulans.", "keywords": "emergency, kecemasan, 999, ambulance, ambulans, chest pain, stroke"}
{"category": "vaccination", "question_en": "What vaccinations are available?", "question_ms": "Apakah vaksin yang tersedia?", "answer_en": "Available at our clinic: COVID-19 booster (free for eligible groups), Influenza (RM30), HPV (RM300/dose, 2-3 doses needed), Hepatitis B (RM50/dose), Pneumococcal (RM120), Tetanus booster (RM40). Walk-in for COVID-19, appointment recommended for others. Bring vaccination record book.", "answer_ms": "Tersedia di klinik kami: Booster COVID-19 (percuma untuk kumpulan layak), Influenza (RM30), HPV (RM300/dos, perlu 2-3 dos), Hepatitis B (RM50/dos), Pneumokokal (RM120), Tetanus booster (RM40). Walk-in untuk COVID-19, temujanji disyorkan untuk lain. Bawa buku rekod vaksin.", "keywords": "vaccination, vaksinasi, vaccine, vaksin, covid, flu, hpv"}
{"category": "cost", "question_en": "How much does a consultation cost?", "question_ms": "Berapa kos perundingan?", "answer_en": "Government clinic rates: General consultation: RM1 (Malaysian citizens with IC), Medication: RM1-5 per prescription, X-ray/lab tests: RM5-20. Non-citizens: RM50-80 consultation. Bring IC, MyKad, or passport. Payment: Cash or online banking (QR code at counter).", "answer_ms": "Kadar klinik kerajaan: Perundingan am: RM1 (warganegara Malaysia dengan IC), Ubat: RM1-5 setiap preskripsi, X-ray/ujian makmal: RM5-20. Bukan warganegara: RM50-80 perundingan. Bawa IC, MyKad, atau pasport. Bayaran: Tunai atau perbankan online (kod QR di kaunter).", "keywords": "cost, kos, price, harga, fee, bayaran, rm, ringgit"}
{"category": "location", "question_en": "Where is the clinic located?", "question_ms": "Di mana lokasi klinik?", "answer_en": "Klinik Kesihatan Petaling Jaya, Jalan 51A/223, Section 51A, 46100 Petaling Jaya, Selangor. Near MBPJ Stadium and Jaya One. Parking: Free parking at rear entrance. Bus: RapidKL T625, T626. LRT: Taman Jaya station (10 min walk). Contact: 03-7956 2424.", "answer_ms": "Klinik Kesihatan Petaling Jaya, Jalan 51A/223, Section 51A, 46100 Petaling Jaya, Selangor. Berhampiran Stadium MBPJ dan Jaya One. Parking: Tempat letak kereta percuma di pintu belakang. Bas: RapidKL T625, T626. LRT: Stesen Taman Jaya (10 min jalan kaki). Hubungi: 03-7956 2424.", "keywords": "location, lokasi, address, alamat, petaling jaya, map, parking"}
{"category": "symptoms_headache", "question_en": "I have a severe headache, what should I do?", "question_ms": "Saya sakit kepala teruk, apa yang perlu saya buat?", "answer_en": "For headache: 1. Rest in a quiet, dark room. 2. Take paracetamol (follow dosage). 3. Stay hydrated. 4. Apply cold compress to forehead. Visit the clinic if: Headache is sudden and severe (worst headache of your life), Accompanied by fever, stiff neck, confusion, vision problems, or vomiting, Headache after head injury, Headache with weakness or numbness. For migraine: Regular medications available at clinic. Emergency: If headache is sudden and extremely severe, call 999 (possible stroke).", "answer_ms": "Untuk sakit kepala: 1. Berehat di bilik sunyi dan gelap. 2. Ambil paracetamol (ikut dos). 3. Minum air banyak. 4. Letak kompres sejuk di dahi. Lawati klinik jika: Sakit kepala tiba-tiba dan teruk (paling teruk pernah alami), Disertai demam, leher kaku, keliru, masalah penglihatan, atau muntah, Sakit kepala selepas kena kepala, Sakit kepala dengan kelemahan atau kebas. Untuk migrain: Ubat tetap ada di klinik. Kecemasan: Jika sakit kepala tiba-tiba dan sangat teruk, hubungi 999 (kemungkinan strok).", "keywords": "headache, sakit kepala, migraine, migrain, head pain, dizziness, pusing"}
{"category": "symptoms_stomach", "question_en": "I have stomach pain and diarrhea, should I come in?", "question_ms": "Saya sakit perut dan cirit-birit, perlu datang ke klinik?", "answer_en": "Come to the clinic if: Diarrhea >3 days, Blood in stool, Severe dehydration (very dark urine, extreme thirst, dizziness), High fever with stomach pain, Severe abdominal pain (sharp, constant). For mild cases: 1. Drink plenty of water or ORS (oral rehydration salts). 2. Eat bland foods (rice, bananas, toast). 3. Avoid spicy, oily, dairy foods. 4. Take rest. Red flags: Black or bloody stool, Unable to keep fluids down, Severe pain → visit clinic immediately. If vomiting blood or severe pain, call 999.", "answer_ms": "Datang ke klinik jika: Cirit-birit >3 hari, Darah dalam najis, Dehidrasi teruk (air kencing sangat gelap, dahaga melampau, pening), Demam tinggi dengan sakit perut, Sakit perut teruk (tajam, berterusan). Untuk kes ringan: 1. Minum air banyak atau ORS (garam rehidrasi). 2. Makan makanan hambar (nasi, pisang, roti bakar). 3. Elak makanan pedas, berminyak, tenusu. 4. Berehat. Tanda bahaya: Najis hitam atau berdarah, Tidak boleh telan cecair, Sakit teruk → lawat klinik segera. Jika muntah darah atau sakit teruk, hubungi 999.", "keywords": "stomach, perut, diarrhea, cirit-birit, vomiting, muntah, food poisoning, keracunan makanan"}
{"category": "symptoms_cold", "question_en": "I have a cold and runny nose, do I need to see a doctor?", "question_ms": "Saya selsema dan hidung berair, perlu jumpa doktor?", "answer_en": "Most colds resolve on their own in 7-10 days. Self-care: 1. Rest and drink warm fluids. 2. Use saline nasal spray. 3. Take paracetamol for discomfort. 4. Gargle with warm salt water for sore throat. Visit the clinic if: Cold lasts >10 days, High fever (>38.5°C), Difficulty breathing or chest pain, Symptoms worsen after initial improvement, Green/yellow thick mucus for >7 days (possible sinus infection). Prevention: Wash hands frequently, wear mask if sick, avoid close contact with others.", "answer_ms": "Kebanyakan selsema sembuh sendiri dalam 7-10 hari. Rawatan sendiri: 1. Berehat dan minum cecair suam. 2. Guna semburan hidung saline. 3. Ambil paracetamol untuk keselesaan. 4. Berkumur air garam suam untuk sakit tekak. Lawati klinik jika: Selsema >10 hari, Demam tinggi (>38.5°C), Sesak nafas atau sakit dada, Simptom bertambah teruk selepas mula baik, Kahak hijau/kuning tebal >7 hari (kemungkinan jangkitan sinus). Pencegahan: Basuh tangan kerap, pakai mask jika sakit, elak sentuhan rapat dengan orang lain.", "keywords": "cold, selsema, runny nose, hidung berair, flu, influenza, sneezing, bersin"}
{"category": "symptoms_sore_throat", "question_en": "My throat is very sore and painful to swallow, what can I do?", "question_ms": "Tekak saya sangat sakit dan sakit menelan, apa yang boleh saya buat?", "answer_en": "For sore throat: 1. Gargle with warm salt water 3-4 times daily. 2. Drink warm fluids (honey lemon tea, soup). 3. Take throat lozenges. 4. Use paracetamol for pain. 5. Rest your voice. Visit the clinic if: Severe pain (unable to swallow saliva), Difficulty breathing, High fever >38.5°C, White patches on throat or tonsils, Sore throat lasts >1 week, Swollen neck glands. May be strep throat (needs antibiotics) or tonsillitis. Emergency: If throat is closing or extreme difficulty breathing, call 999.", "answer_ms": "Untuk sakit tekak: 1. Berkumur air garam suam 3-4 kali sehari. 2. Minum cecair suam (teh lemon madu, sup). 3. Guna gula-gula tekak. 4. Ambil paracetamol untuk sakit. 5. Rehatkan suara. Lawati klinik jika: Sakit teruk (tak boleh telan air liur), Sesak nafas, Demam tinggi >38.5°C, Tompok putih di tekak atau tonsil, Sakit tekak >1 minggu, Kelenjar leher bengkak. Mungkin strep throat (perlu antibiotik) atau tonsilitis. Kecemasan: Jika tekak tutup atau sesak nafas teruk, hubungi 999.", "keywords": "sore throat, sakit tekak, painful swallowing, sakit menelan, tonsillitis, strep throat"}
{"category": "chronic_disease", "question_en": "I have diabetes/high blood pressure, can I get follow-up care here?", "question_ms": "Saya ada kencing manis/darah tinggi, boleh dapat rawatan susulan di sini?", "answer_en": "Yes! We provide chronic disease management: Diabetes: Blood sugar monitoring, medication refills, HbA1c tests, foot checks, dietary advice. Cost: RM1 consultation + RM1-5 medication. High Blood Pressure: BP monitoring, medication refills, lifestyle counseling. Cost: RM1 consultation + RM1-5 medication. Other chronic diseases: Asthma, cholesterol, thyroid conditions also managed here. Schedule: Regular follow-ups every 1-3 months (doctor will advise). Bring: Previous medical records, current medications, BP/glucose logbook if you have one. Free health education sessions available monthly.", "answer_ms": "Ya! Kami sediakan pengurusan penyakit kronik: Kencing Manis: Pemantauan gula darah, pengisian semula ubat, ujian HbA1c, pemeriksaan kaki, nasihat diet. Kos: RM1 perundingan + RM1-5 ubat. Darah Tinggi: Pemantauan BP, pengisian semula ubat, kaunseling gaya hidup. Kos: RM1 perundingan + RM1-5 ubat. Penyakit kronik lain: Asma, kolesterol, keadaan tiroid juga diuruskan di sini. Jadual: Susulan tetap setiap 1-3 bulan (doktor akan nasihat). Bawa: Rekod perubatan lama, ubat semasa, buku log BP/glukosa jika ada. Sesi pendidikan kesihatan percuma setiap bulan.", "keywords": "diabetes, kencing manis, high blood pressure, darah tinggi, chronic, kronik, medication refill, pengisian ubat"}
{"category": "women_health", "question_en": "Do you provide women's health services like Pap smear and pregnancy care?", "question_ms": "Adakah anda menyediakan perkhidmatan kesihatan wanita seperti Pap smear dan penjagaan kehamilan?", "answer_en": "Yes! Women's health services available: Pap Smear: RM5 (for cervical cancer screening, recommended every 3 years for women 21-65). Pregnancy Care: Free antenatal checkups for Malaysian citizens, Ultrasound scans, Blood tests, Nutrition counseling, Delivery referral to hospital. Family Planning: Contraception counseling, Pills (RM1/month), IUD insertion, Condoms (free). Breast Exam: Clinical breast examination for lumps. Menstrual Issues: Irregular periods, heavy bleeding, painful periods consultation. HPV Vaccine: RM300/dose (cervical cancer prevention). Book appointment for women's health clinic (specific days/times).", "answer_ms": "Ya! Perkhidmatan kesihatan wanita tersedia: Pap Smear: RM5 (saringan kanser serviks, disyorkan setiap 3 tahun untuk wanita 21-65). Penjagaan Kehamilan: Pemeriksaan antenatal percuma untuk warganegara Malaysia, Imbasan ultrasound, Ujian darah, Kaunseling pemakanan, Rujukan bersalin ke hospital. Perancangan Keluarga: Kaunseling kontraseptif, Pil (RM1/bulan), Pemasangan IUD, Kondom (percuma). Pemeriksaan Payudara: Pemeriksaan klinikal untuk benjolan. Isu Haid: Haid tidak teratur, pendarahan berat, haid sakit perundingan. Vaksin HPV: RM300/dos (pencegahan kanser serviks). Tempah temujanji untuk klinik kesihatan wanita (hari/masa tertentu).", "keywords": "women, wanita, pregnancy, kehamilan, pap smear, contraception, kontraseptif, menstrual, haid"}
{"category": "child_health", "question_en": "What services do you offer for babies and children?", "question_ms": "Apakah perkhidmatan yang anda tawarkan untuk bayi dan kanak-kanak?", "answer_en": "Pediatric services available: Baby Clinic: Free growth monitoring (weight, height, head circumference), Developmental milestones assessment, Nutrition advice for breastfeeding/formula. Immunization: Free vaccines under National Immunization Program (BCG, Hepatitis B, DTP, MMR, etc.), Bring vaccination book (Buku Rekod Kesihatan). Schedule: Birth to 18 months (monthly), then follow schedule. Child Health: Fever, cough, rash, diarrhea treatment, Growth concerns (underweight, overweight), Speech/development delays referral. School Health: Health screening for primary school students. Hours: Baby clinic runs Tuesday & Thursday mornings (walk-in, first-come-first-served). For sick children: Regular clinic hours Mon-Fri.", "answer_ms": "Perkhidmatan pediatrik tersedia: Klinik Bayi: Pemantauan pertumbuhan percuma (berat, tinggi, lilitan kepala), Penilaian perkembangan, Nasihat pemakanan penyusuan/formula. Imunisasi: Vaksin percuma di bawah Program Imunisasi Kebangsaan (BCG, Hepatitis B, DTP, MMR, dll), Bawa buku vaksin (Buku Rekod Kesihatan). Jadual: Lahir hingga 18 bulan (bulanan), kemudian ikut jadual. Kesihatan Kanak-kanak: Rawatan demam, batuk, ruam, cirit-birit, Kebimbangan pertumbuhan (berat kurang, berlebihan), Rujukan kelewatan percakapan/perkembangan. Kesihatan Sekolah: Saringan kesihatan pelajar sekolah rendah. Waktu: Klinik bayi buka Selasa & Khamis pagi (walk-in, first-come-first-served). Untuk kanak-kanak sakit: Waktu klinik biasa Isnin-Jumaat.", "keywords": "baby, bayi, child, kanak-kanak, immunization, imunisasi, vaccination, vaksinasi, pediatric"}
{"category": "mental_health", "question_en": "Can I get help for anxiety, depression, or mental health issues?", "question_ms": "Bolehkah saya mendapat bantuan untuk kebimbangan, kemurungan, atau isu kesihatan mental?", "answer_en": "Yes, we provide basic mental health support: Services: Initial counseling and assessment, Medication for anxiety/depression (if needed), Referral to psychiatrist or Hospital Psychiatry for severe cases, Stress management advice. Cost: RM1 consultation. Confidential and non-judgmental care. When to seek help: Persistent sadness or hopelessness >2 weeks, Anxiety interfering with daily life, Sleep problems, Loss of interest in activities, Suicidal thoughts (if immediate risk, call 999 or Befrienders: 03-7627 2929). Resources: Talian Kasih (15999) - free counseling, Befrienders KL (03-7627 2929) - 24/7 emotional support. We're here to help. Mental health is as important as physical health.", "answer_ms": "Ya, kami sediakan sokongan kesihatan mental asas: Perkhidmatan: Kaunseling awal dan penilaian, Ubat untuk kebimbangan/kemurungan (jika perlu), Rujukan ke pakar psikiatri atau Hospital Psikiatri untuk kes teruk, Nasihat pengurusan tekanan. Kos: RM1 perundingan. Penjagaan sulit dan tanpa prejudis. Bila perlu bantuan: Kesedihan atau putus asa berterusan >2 minggu, Kebimbangan mengganggu kehidupan harian, Masalah tidur, Hilang minat aktiviti, Fikiran bunuh diri (jika risiko segera, hubungi 999 atau Befrienders: 03-7627 2929). Sumber: Talian Kasih (15999) - kaunseling percuma, Befrienders KL (03-7627 2929) - sokongan emosi 24/7. Kami di sini untuk membantu. Kesihatan mental sama penting dengan kesihatan fizikal.", "keywords": "mental health, kesihatan mental, anxiety, kebimbangan, depression, kemurungan, stress, tekanan, counseling, kaunseling"}
{"category": "lab_tests", "question_en": "What lab tests can I get done here and how much do they cost?", "question_ms": "Apakah ujian makmal yang boleh saya buat di sini dan berapa kosnya?", "answer_en": "Common lab tests available: Blood Tests: Full Blood Count (FBC): RM5, Blood Sugar (fasting/random): RM3, HbA1c (diabetes monitoring): RM10, Lipid Profile (cholesterol): RM15, Liver Function Test: RM15, Kidney Function Test: RM10, Thyroid Function Test: RM20. Urine Tests: Urinalysis: RM2, Pregnancy test: RM3. Other: X-ray: RM10-20 (depending on body part), ECG (heart): RM5. Procedure: Doctor will order tests during consultation, Some tests require fasting (8 hours), Results ready in 3-7 days (collect at clinic or doctor will call). Non-citizens: Prices 3-5x higher.", "answer_ms": "Ujian makmal biasa tersedia: Ujian Darah: Kiraan Darah Penuh (FBC): RM5, Gula Darah (puasa/rawak): RM3, HbA1c (pemantauan diabetes): RM10, Profil Lipid (kolesterol): RM15, Ujian Fungsi Hati: RM15, Ujian Fungsi Buah Pinggang: RM10, Ujian Fungsi Tiroid: RM20. Ujian Air Kencing: Urinalisis: RM2, Ujian kehamilan: RM3. Lain-lain: X-ray: RM10-20 (bergantung bahagian badan), ECG (jantung): RM5. Prosedur: Doktor akan order ujian semasa perundingan, Sesetengah ujian perlu puasa (8 jam), Keputusan siap dalam 3-7 hari (ambil di klinik atau doktor akan call). Bukan warganegara: Harga 3-5x lebih tinggi.", "keywords": "lab test, ujian makmal, blood test, ujian darah, x-ray, cholesterol, kolesterol, diabetes"}
{"category": "medication", "question_en": "Can I get prescription refills without seeing the doctor?", "question_ms": "Bolehkah saya dapatkan pengisian semula preskripsi tanpa jumpa doktor?", "answer_en": "Depends on medication type: Chronic Disease Medications: Yes, for stable chronic conditions (diabetes, high blood pressure, asthma), Prescription refills available with quick check (BP/glucose measurement), Must see doctor every 3-6 months for full review. Antibiotics/Acute Medications: No, doctor consultation required, Antibiotics cannot be refilled without assessment. Controlled Medications: Must see doctor every time. Procedure: 1. Bring your previous medication packaging or prescription slip, 2. Nurse will check vitals, 3. Collect medication at pharmacy counter. Cost: RM1-5 per medication. If you've run out of medication, call us to check if refill is possible or appointment needed: 03-7956 2424.", "answer_ms": "Bergantung kepada jenis ubat: Ubat Penyakit Kronik: Ya, untuk keadaan kronik yang stabil (diabetes, darah tinggi, asma), Pengisian semula preskripsi tersedia dengan pemeriksaan cepat (ukur BP/glukosa), Mesti jumpa doktor setiap 3-6 bulan untuk kajian penuh. Antibiotik/Ubat Akut: Tidak, perundingan doktor diperlukan, Antibiotik tidak boleh diisi semula tanpa penilaian. Ubat Terkawal: Mesti jumpa doktor setiap kali. Prosedur: 1. Bawa pembungkusan ubat lama atau slip preskripsi, 2. Jururawat akan periksa vital, 3. Ambil ubat di kaunter farmasi. Kos: RM1-5 setiap ubat. Jika ubat habis, call kami untuk check jika refill boleh atau perlukan temujanji: 03-7956 2424.", "keywords": "medication, ubat, prescription refill, pengisian semula preskripsi, antibiotics, antibiotik, chronic"}
{"category": "referral", "question_en": "If I need to see a specialist, can you refer me to a hospital?", "question_ms": "Jika saya perlu jumpa pakar, bolehkah anda rujuk saya ke hospital?", "answer_en": "Yes! We provide specialist referrals: Process: 1. See our doctor for initial assessment, 2. Doctor will write referral letter if specialist care needed, 3. Choose: Government Hospital (cheaper, longer wait) or Private Hospital (expensive, faster). Government Hospital Referral: Common specialties: Cardiology, ENT, Orthopedics, Surgery, Dermatology, etc., Referred to Hospital Sungai Buloh, HUKM, or HKL, Appointment usually 1-6 months (depending on urgency), Cost: Much cheaper (RM5-50 per visit). Private Hospital: Faster appointment (1-2 weeks), Cost: RM100-300+ per visit, Need to pay yourself or use insurance/panel. Bring: Referral letter, all test results, medication list, IC. Emergency cases: Direct referral to hospital Emergency Department.", "answer_ms": "Ya! Kami sediakan rujukan pakar: Proses: 1. Jumpa doktor kami untuk penilaian awal, 2. Doktor akan tulis surat rujukan jika penjagaan pakar diperlukan, 3. Pilih: Hospital Kerajaan (murah, tunggu lama) atau Hospital Swasta (mahal, cepat). Rujukan Hospital Kerajaan: Kepakaran biasa: Kardiologi, ENT, Ortopedik, Pembedahan, Dermatologi, dll, Dirujuk ke Hospital Sungai Buloh, HUKM, atau HKL, Temujanji biasanya 1-6 bulan (bergantung keterukan), Kos: Jauh lebih murah (RM5-50 setiap lawatan). Hospital Swasta: Temujanji lebih cepat (1-2 minggu), Kos: RM100-300+ setiap lawatan, Perlu bayar sendiri atau guna insurans/panel. Bawa: Surat rujukan, semua keputusan ujian, senarai ubat, IC. Kes kecemasan: Rujukan terus ke Jabatan Kecemasan hospital.", "keywords": "referral, rujukan, specialist, pakar, hospital, emergency, kecemasan"}
